Sync from hippocampus 2026-02-19
